class Tenkijp
  BASE_URL = 'http://www.tenki.jp/forecast/'

  PATH_TABLE = {
    '北海道' => '1/',
    '青森県' => '2/5/', '岩手県' => '2/6/', '宮城県' => '2/7/', '秋田県' => '2/8/', '山形県' => '2/9/', '福島県' => '2/10/',
    '茨城県' => '3/11/', '栃木県' => '3/12/', '群馬県' => '3/13/', '埼玉県' => '3/14/', '千葉県' => '3/15/', '東京都' => '3/16/', '神奈川県' => '3/17/',
    '山梨県' => '3/22', '長野県' => '3/23',
    '新潟県' => '4/18/', '富山県' => '4/19/', '石川県' => '4/20/', '福井県' => '4/21/',
    '岐阜県' => '5/24/', '静岡県' => '5/25/', '愛知県' => '5/26/', '三重県' => '5/27/',
    '滋賀県' => '6/28/', '京都府' => '6/29/', '大阪府' => '6/30/', '兵庫県' => '6/31/', '奈良県' => '6/32/', '和歌山県' => '6/33/',
    '鳥取県' => '7/34/', '島根県' => '7/35/', '岡山県' => '7/36/', '広島県' => '7/37/', '山口県' => '7/38/',
    '徳島県' => '8/39/', '香川県' => '8/40/', '愛媛県' => '8/41/', '高知県' => '8/42/',
    '福岡県' => '9/43/', '佐賀県' => '9/44/', '長崎県' => '9/45/', '熊本県' => '9/46/', '大分県' => '9/47/', '宮崎県' => '9/48/', '鹿児島県' => '9/49/',
    '沖縄県' => '10/'
  }

  class << self
    def url_by_prefecture(prefecture)
      BASE_URL + PATH_TABLE[prefecture].to_s
    end
  end
end
